#include <iostream>
using namespace std;

int main() {
    // Създава символ с номер 0, а не символа нула, т.е. а съдържа NULL
    char a = 0;
    int j = 0;

    // Ще цикли от 0 до ASCII кода на символа 9, т.е. до 57
    for (int i = a; i < '9'; i += 2) {
        // Дефинираното горе j ще се увеличи с 1.
        j++;

        // Създава се ново j в scope-а на цикъла.
        int j = 2;
        cout << "i: " << i << endl;
        // Увеличава се новосъздаденото j, т.е. вътрешното има стойност 3,
        // докато j, дефинирано на ред 7, се е увеличило с 1 в рамките на
        // една итерация на цикъла. На следващата итерация новото j ще се изтрие и
        // процесът ще се повтори.
        j++;
    }

    // Това ще изведе 29
    cout << "j: " << j << endl;

    // При логическо или проверката на следващите клаузи се прекратява, ако
    // се открие клауза, която е истина. В случая на j ще се присвои стойност j (0 + j)
    // и няма да се изпълни j++, тъй като първоначално ще е 29, което се конвертира до истина.
    // Вътре в тялото на цикъла вече j ще се намали ипри следващата итерация на j
    // ще се присвои стойност с едно по-малка от тази на предишната итерация.
    // Когато се изпълни j = 0, това вече ще се оцени на лъжа и ще се изпълни втората клауза,
    // т.е. j ще се увеличи с едно, но като резултат ще се върне старата стойност поради
    // спецификата на постфиксния оператор ++, която е 0 -> лъжа, т.е. ще се излезне от цикъла
    // и j ще има стойност 1.
    while ((j = a + j) || j++)
        j--;

    cout << "j*: " << j << endl;
    return 0;
}
